{"format": "layers-model", "generatedBy": "keras v2.1.6", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "batch_input_shape": [null, 128], "dtype": "float32", "units": 14272, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [892, 4, 4]}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.30000001192092896}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": 1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_1", "trainable": true, "filters": 548, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.30000001192092896}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "axis": 1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_2", "trainable": true, "filters": 337, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.30000001192092896}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "axis": 1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_3", "trainable": true, "filters": 207, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.30000001192092896}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "axis": 1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_4", "trainable": true, "filters": 127, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.30000001192092896}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "axis": 1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_5", "trainable": true, "filters": 3, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "weightsManifest": [{"paths": ["group1-shard1of21.bin", "group1-shard2of21.bin", "group1-shard3of21.bin", "group1-shard4of21.bin", "group1-shard5of21.bin", "group1-shard6of21.bin", "group1-shard7of21.bin", "group1-shard8of21.bin", "group1-shard9of21.bin", "group1-shard10of21.bin", "group1-shard11of21.bin", "group1-shard12of21.bin", "group1-shard13of21.bin", "group1-shard14of21.bin", "group1-shard15of21.bin", "group1-shard16of21.bin", "group1-shard17of21.bin", "group1-shard18of21.bin", "group1-shard19of21.bin", "group1-shard20of21.bin", "group1-shard21of21.bin"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [892], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [892], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [892], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [892], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [548], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [548], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [548], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [548], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [337], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [337], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [337], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [337], "dtype": "float32"}, {"name": "batch_normalization_4/gamma", "shape": [207], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [207], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [207], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [207], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [127], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [127], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [127], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [127], "dtype": "float32"}, {"name": "conv2d_transpose_1/kernel", "shape": [5, 5, 548, 892], "dtype": "float32"}, {"name": "conv2d_transpose_1/bias", "shape": [548], "dtype": "float32"}, {"name": "conv2d_transpose_2/kernel", "shape": [5, 5, 337, 548], "dtype": "float32"}, {"name": "conv2d_transpose_2/bias", "shape": [337], "dtype": "float32"}, {"name": "conv2d_transpose_3/kernel", "shape": [5, 5, 207, 337], "dtype": "float32"}, {"name": "conv2d_transpose_3/bias", "shape": [207], "dtype": "float32"}, {"name": "conv2d_transpose_4/kernel", "shape": [5, 5, 127, 207], "dtype": "float32"}, {"name": "conv2d_transpose_4/bias", "shape": [127], "dtype": "float32"}, {"name": "conv2d_transpose_5/kernel", "shape": [5, 5, 3, 127], "dtype": "float32"}, {"name": "conv2d_transpose_5/bias", "shape": [3], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [128, 14272], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [14272], "dtype": "float32"}]}]}